title lab1.asm

.MODEL tiny
.DATA

;byte
i db 0, 255
i1 db -255;не входить в діапазон
ii db -128, 127

; числа відповідно до варіанту
;byte
a db 151
a11 db 121
a22 db -121


;word
r0 dw -255
r dw 0, 65535
r1 dw -1, -32767
r2 dw 1, 32767
r3 dw -65535 ;не входить в діапазон
r4 dd -65535


; числа відповідно до варіанту

;word
b0 dw -151
b dw 1740
b1 dw 1710
b2 dw -1710
b3 dw -1740





k db -8
db -10
dw -10
db 15
db -15
db 0feh
db 0b12h
;не входить в діапазон
db 01100110b
dw 10001011b
dw 13
dw '0f'
dw 0245h
dw 0101b
dw 0a32h
dw 0f45h
dw 55
dw 0c47h
dw 0afh
dd 4, 8, 0ah, 0ffh
dw -15
db -16
dw -16
r db 127
q  db -127
t1 dw -127
db 128
i db -128
i1 dw -128
;???
w db -129
p dw -129
db 255
;???
db -255
;не входить в діапазон
db 256
dw 256
;змінна q вже іншого типу
q dw -32768
rr1 df -32768
zz1 dd -32768
j dw 32767
a dw 65535
dw -65535
dd -2147583648
dd 2147583647
dq -2147583648
dq 2147583647
ll dw 10101000b
; число b12 не входить в діапазон
ff db 12, "№", 0b12h
f1 dw 12, "№", 0b12h
g5 db 0101b
;SS - сегмент стека виконаної програми.Існують певні обмеження відносно застосування регістрів загального призначення як базових або індексних при формуванні ефективної адреси:– регістр ESP не можна використовувати як індексний регістр:



ss dw 00000101b
xx dq 26 
c1 dw 0f45h, 55, 66
a1 db -113
a2 dw -113
ii db -159
s1 db -89
ss5 dw -89
s2 db -92
s3 dw -231
a11 db "sigma"
;через те що перед числом e301 не поставили нуль, тобто не оголошено що це число.
a22 dw e301h
a33 db 12
a55 dw offset a11
a66 dw 13
gg dw -123
hh dw -9





ss dw 12
ds dw 12

cs dw 12
es dw 12 
fs dw 12
gs db 12


end