#include <stdio.h>
#include <math.h>
int main() {// Викликаємо основний клас main

//////////////////////////////////////////////////////////////////////////////////////////////////
float a, b, x;
float y = 0;//створимо змінні типу float

printf("Введіть значення змінним a, b, x\n");//Виведемо на екран текст "Input a,b,x"; \n- означає переведення но новий рядок

printf("Input a: ");
scanf("%f", &a );

printf("Input b: ");
scanf("%f", &b );

printf("Input x: ");
scanf("%f", &x );  //За допомогою сканера присвоюємо значення a, b, x
//////////////////////////////////////////////////////////////////////////////////////////////////


//створюємо умовний оператор if-else
//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$//
if(x<1){//задаємо першу умову згідно варіанту
  if(a*x - 2 != 0){//також згідно рівняння випливає додаткова умова
    y = b / (fabs( a * x - 2));//присвоюємо змінній "y" значення за умовою 
      printf("\nResult y = %.4f", y);//вивід на екран результата
      
  }
  else {//у випадку коли додаткова умова не виконується на екран буде виведено "error"
    printf("\nerror");
  }
}

//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$//


//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$//
else if(x>=1 && x < 3){//задаємо другу умову згідно варіанту
  y = exp(a*x) - b; //присвоюємо змінній "y" значення за умовою 
    printf("\nResult y = %.4f", y);//вивід на екран результата
}
//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$//

//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$//
else if(x >= 3){//задаємо третю умову згідно варіанту
  if(pow(b,2) - x > 0  && pow(b,2) - x != 1   ){//також згідно рівняння випливає додаткова умова
    y = a / log( pow(b,2) - x) ;//присвоюємо змінній "y" значення за умовою 
      printf("\nResult y = %.4f", y);//вивід на екран результата
  }
  else {//у випадку коли додаткова умова не виконується на екран буде виведено "error"
    printf("\nerror");
  }
}
//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$//
}
