#include <math.h>//Додамо бібліотеку для виконання простих математичних операцій
#include <stdio.h>

int main(void) {//Створення основного метода main

//\/\/\/\\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
float a, b, x, y ;//створимо змінні типу float

printf("Input a, b, x\n");//Виведемо на екран текст "Input a,b,x"; \n- означає переведення но новий рядок

printf("Input a: ");
scanf("%f", &a );

printf("Input b: ");
scanf("%f", &b );

printf("Input x: ");
scanf("%f", &x );  //За допомогою сканера присвоюємо значення a, b, x
//\/\/\/\\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/


//\/\/\/\\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
if( a * b * x > 0 && x > 0 ) {//надаємо умову згідно приклада

  y=2. / 7 * b * powf( x, 1. / 3) + exp(fabs(x)) + log(a * b  * x );//Вводимо математичний приклад

  printf("Result y = %.4f", y);//Виводимо на екран результат обчислення
}
//\/\/\/\\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/


//\/\/\/\\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
else{//якщо умова не виконана виконується "else"

  printf("error");//Виведення на екран текст "error"
}
  return 0;
}
//\/\/\/\\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/


